Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་སྐལ་བ་བཟང་པོ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྒྱལ་བའི་སྡེ་དེ་ལ། །གསེར་ལས་བྱས་པའི་བླ་རེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Subhaga, when a captain, Offered a canopy made of gold To the thus-gone Victorious Army And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མི་འཁྲུགས་མདོག་ནི་རྫ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེན་པའི་བློ་དེ་ལ། །རྫེའུ་ཕྲུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Akṣobhyavarṇa, when a potter, Offered small earthen pots To the thus-gone Truth Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་རྒྱལ་པོ་གྲོང་དཔོན་ཚེ། །གྲོང་ཁྱེར་དག་ནི་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་གོ་བགོས་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Tejorāja, when the head of a city, Swept the city clean Before the thus-gone Bearer of the Armor of Splendor, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྟོགས་མཛད་ལག་བླའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ངེས་པར་རྟོགས་བཟོད་ལ། །ཀ་ར་བཱི་རའི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Bodhana, when a supervisor of a new building, Offered karavīra flowers To the thus-gone Acceptance of Certain Realization And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤྱན་ལེགས་ཕྱུགས་རྫིའི་དཔོན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་མཆོག་དཔལ་དེ་ལ། །ལྷུང་བཟེད་མོ་ར་ནས་བཀང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sulocana, when a leader of herdsmen, Offered an alms bowl filled with buttermilk To the thus-gone Moon of Supreme Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་གནས་བློ་ནི་ནད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གླང་པོའི་སྟབས་དེ་ཡི། །ཉིན་མོ་བཞུགས་པའི་གནས་ཁང་ཕྱགས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sthitārtha­buddhi, when suffering from illness, Swept the daytime residence clean For the thus-gone Elephant Character And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྣང་བའི་འོད་ཟེར་ལྷ་འབངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཁས་པའི་གཙོ་དེ་ལ། །མར་མེའི་སྙིང་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ābhāsaraśmi, when a servant of gods, Offered lamp wicks To the thus-gone Foremost among the Learned And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་གཟི་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེན་པ་དགྱེས་དེ་ལ། །ཨུད་པལ་སྔོན་པོ་གཅིག་ཅིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Gandhatejas, when a king, Offered blue utpalas To the thus-gone Delighting in the Truth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཀུན་དགའ་མཛད་པ་ཤིང་རྟ་མཁན། །བྱེད་ཚེ་བདེ་གཤེགས་ཨུད་པལ་དྲི་དེ་ལ། །སྣམ་ཕྱི་ས་དག་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Saṃtoṣaṇa, when a chariot maker, Built bathrooms and offered them To the well-gone Utpala Fragrance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དོན་ཡོད་གཤེགས་པ་ལག་བླའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་དབང་ཕྱུག་ལ། །ལོ་མའི་སྤྱིལ་བུ་བྱས་ཏེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amoghagāmin, when a supervisor of a new building, Made a cottage of grass and offered it To the thus-gone Incense Master And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁྲོ་བཅོམ་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཙམ་པའི་མཆོག་དེ་ལ། །རྫིང་བུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhasmakrodha, when a merchant’s son, Offered a pond To the thus-gone Supreme Campaka And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟུགས་མཆོག་ཐ་ག་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་སྙོམས་པ་ལ། །དབྱར་གནས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vararūpa, when a weaver, Brought offerings of the rains retreat To the thus-gone Balanced Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་གཤེགས་རོལ་མོ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཤེས་པའི་དཔལ་དེ་ལ། །རོལ་མོའི་རྔ་ཆེན་བརྡུངས་ཏེ་མཆོད་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sukrama, when a musician, Offered the music of large drums To the thus-gone Glorious Knowledge And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་སྦྱིན་གྲགས་པ་ལ་ཀུ་ས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཆེན་པོ་དེ་ལ་ནི། །འདག་པའི་ཆལ་དག་སྦྱར་ཏེ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradānakīrti, when a lakusa maker, Offered soap To the thus-gone Great Splendor And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་གཙང་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་གསུང་དེ་ལ། །བུ་ཡུག་ལངས་ཚེ་འཇམས་དང་བཏུང་བ་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śuddhaprabha, when a householder, Offered rice gruel and drink during a snowstorm To the thus-gone Diverse Teaching And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཉི་ཕྱུགས་རྫིའི་དཔོན་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འདམ་ལས་རྒལ་བ་ལ། །ཞུན་མར་ཅི་དགོས་པ་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Devasūrya, when the leader of herdsmen, Offered however much clarified butter would be required To the thus-gone Traverser of the Swamp And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་བྱིན་ནི་ཕུབ་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་སྤྱན་དེ་ལ། །ཕུབ་དག་བྱས་ཏེ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñādatta, when a clasp maker, Made clasps and offered them To the thus-gone Infinite Eye And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཉམ་གཞག་བདག་ཉིད་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་འབར་དེ་ལ་ནི། །ཏིལ་འབྲུ་སྤར་བ་བཀང་སྟེ་གཏོར་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Samāhitātman, when a householder, Filled his hands with sesame seeds and scattered them Before the thus-gone Blazing Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་མདངས་འབྲུ་མར་སྤོས་ཅན་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་པར་འོས་པའི་དཔལ་དེ་ལ། །སྣ་མའི་མེ་ཏོག་ཡོད་པའི་འབྲུ་མར་སྲང་བརྒྱད་ཕུལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ojastejas, when a maker of fragrant oils, Offered eight measures of oil containing sumanā flowers To the thus-gone Glory Worthy of Worship And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རྒྱལ་རིགས་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣ་ཚོགས་དབྱངས་དེ་ལ། །ལམ་སྲང་དག་ནི་མཚོན་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kṣatriya, when a guide, Showed the way To the thus-gone Diverse Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐལ་ལྡན་ཤིང་རྟ་བུ་རམ་ཆང་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་དམིགས་པ་བྱིན་དེ་ལ། །སྐྱུ་རུ་ར་ཡི་བཅུད་ཁུ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhāgīrathi, when a rum producer, Offered myrobalan fruit juice To the thus-gone Gift of the Observation of Qualities And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གསེར་མཆོག་ཚ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཙང་མར་གནས་དེ་དག །ཟླ་བ་གསུམ་དུ་ཚྭ་ལ་སྤྱན་དྲངས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Suvarṇottama, when a salt merchant, Offered salt for three months To the thus-gone Pure Abiding And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་པར་གྲོལ་གཙུག་ཞིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་དྲི་ཞིམ་སྤོས་དེ་ལ། །རྒུན་འབྲུའི་བཅུད་ཁུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vimuktacūḍa, when a forest guard, Offered grape juice To the thus-gone Fragrant Incense And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ལྡན་ཡུར་བ་མཁན་གྱི་ཚེ། །ཡུར་བ་དག་ནི་བརྐོས་ཏེ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dhārmika, when a canal builder, Dug out canals Before the thus-gone Moonlight, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་གནས་ཚོང་དཔོན་ཆུང་མའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རི་བོའི་ཕུང་པོ་ལ། །དབྱར་གནས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sthitagandha, when the wife of a merchant, Provided offerings for the rains retreat Before the thus-gone Mountain Mass And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དྲེགས་སྤངས་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་དེ་ལ་ནི། །འབྲུ་མར་བཏུང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Madaprahīṇa, when a physician, Offered drinkable oil To the thus-gone Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་མཛོད་ནི་ཐགས་མཁན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་མཆོག་དེ་ལ། །རས་ཀྱི་ཁ་ཚར་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānakośa, when a weaver, Offered woven tassels To the thus-gone Supreme Intelligence And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་གཤེགས་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་པར་འོས་དེ་ལ། །མེ་ཏོག་འབར་ཤིའི་ཆུན་ཕྲེང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmagāmin, when the son of a merchant, Offered garlands of vārṣikī flowers To the thus-gone Worthy of Worship And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཙན་དན་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རི་དབང་བརྩེགས་པ་ལ། །བ་སོ་དག་ལས་བྱས་པའི་གདན་ཁྲི་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Candana, when a merchant, Offered a throne of ivory To the thus-gone Majestic King of Mountains And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མྱ་ངན་མེད་པ་གསེར་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་འབར་དེ་ལ་ནི། །དངུལ་ལས་བྱས་པའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Aśoka, when a goldsmith, Scattered flowers made of silver Before the thus-gone Blazing Light And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་འོད་ཟེར་ནི། །ཨ་བ་ཀ་རར་གྱུར་ཚེ་དེ་བཞིན་གཤེགས། །སྣང་བའི་གཙོ་ལ་ཨ་བ་ཀན་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Siṃharaśmi, when a sweeper, Offered avaka plants To the thus-gone Foremost Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡུལ་འཁོར་ཏོག་ནི་ཚོང་པའི་ཚེ། །བདེ་གཤེགས་སྣ་ཚོགས་དབྱངས་བརྒྱན་དེ་ལ་ནི། །བ་སོའི་ཁང་པ་བརྩེགས་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Keturāṣṭra, when a merchant, Offered a multistoried ivory house To the well-gone Adorned with Diverse Melody And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་པད་མའི་སྙིང་པོ་དགེ་སློང་ཚེ། །འཇི་བ་དག་ལས་གཟུགས་ནི་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་དོན་ལ་དགྱེས་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Padmagarbha, when a monk, Made an image out of clay For the thus-gone Delighting in the Meaning, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་མཐའ་ཡས་ཆང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱོད་པ་གསལ་དེ་ལ། །བཀྲུ་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anantatejas, when an alcohol vendor, Offered bathing articles To the thus-gone Clear Conduct And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཡི་འོད་ཟེར་དགེ་སློང་ཚེ། །བཅྭ་ལྔའི་ཚེ་ན་ཆོས་ཀྱི་སྦྱིན་བྱས་ནས། །དེ་བཞིན་གཤེགས་པ་མྱ་ངན་སྤོང་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Devaraśmi, when a monk, Offered the gift of Dharma on the day of the full moon Before the thus-gone Relinquishing Suffering, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤེས་རབ་མེ་ཏོག་སྤུག་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མངོན་ཤེས་འོད་དེ་ལ། །སྤུག་གི་ནོར་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Prajñāpuṣpa, when a gem seller, Offered gemstones To the thus-gone Light of Superknowledge And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཁས་པ་འབྲས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མདངས་ཀྱི་སྟོབས་དེ་ལ། །འབྲས་ཀྱིས་སྤར་བ་བཀང་སྟེ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vidvat, when a rice seller, Offered handfuls of rice To the thus-gone Bright Strength And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་འབྱོར་ལྡན་ནི། །ཤིང་རྟ་མཁན་ཚེ་བདེ་གཤེགས་གསལ་བའི་དཔལ། །དེ་ཡི་རླུང་སྐྱབས་དག་ནི་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Samṛddhajñāna, when a chariot maker, Offered protection against the wind To the well-gone Glory of Clarity And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཚངས་དབྱིག་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐོང་བར་གྲགས་དེ་ལ། །ག་ན་ཀོ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Brahmavasu, when a forest guard, Offered kanaka plants To the thus-gone Renowned Vision And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཕྱག་ན་རིན་ཆེན་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་གྲོལ་འོད་ཟེར་དེའི། །ན་བཟའ་དག་ནི་ཁ་དོག་བསྒྱུར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnapāṇi, when a king, Dyed the garments Of the thus-gone Radiance of Liberation And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དབང་ལྡན་ཚལ་གྱི་ལས་བྱེད་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡིད་གཉིས་རྣམ་གནོན་ལ། །ཁར་ཛུ་ར་ཡི་འབྲས་བུ་བརྒྱད་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Indrama, when a gardener, Offered eight khajurā fruits To the thus-gone Subjugator of Doubt And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྫོགས་པར་གསུང་བ་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་དུས་མཁྱེན་རྒྱལ་པོ་ལ། །སྟར་ག་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anupamavādin, when a forest guard, Offered walnuts To the thus-gone King of Timely Knowledge And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཆོག་གསུང་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ནགས་ཀྱི་མེ་ཏོག་ལ། །འགོ་ཏ་ར་ནའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jyeṣṭhavādin, when a forest guard, Scattered gotaraṇi flowers Before the thus-gone Forest Flower And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་འོས་རྒྱལ་བུའི་ཚེ། །རྫིང་བུ་དག་ནི་བྱས་ཏེ་བཤམས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་དཔལ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Pūjya, when a prince, Built and prepared ponds Before the thus-gone Flower Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཉི་མ་བློན་པོ་ཆེན་པོའི་ཚེ། །བདེ་གཤེགས་རྣམ་པར་སྨིན་པ་ཆེན་པོ་ལ། །རྡོ་ལས་བྱས་པའི་ཁང་པ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sūrya, when a chief minister, Offered stone mansions To the well-gone Great Ripening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འདམ་ལས་རྒལ་བ་སྐུད་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཆེན་པོ་ལ། །སྐུད་པ་སྲང་གཅིག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Uttīrṇapaṅka, when a thread seller, Offered a measure of thread To the thus-gone Great Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་བརྙེས་པ་ཆང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཤེགས་པར་དགྱེས་དེ་ལ། །བཅུད་ཁུའི་བཏུང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānaprāpta, when an alcohol vendor, Offered nutritious juices To the thus-gone Delight in Going And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གྲུབ་པ་གྲོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩི་རྣམ་གནོན་ལ། །གྲོང་གི་མཆོག་མ་བཅུ་ཞིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Siddhi, when the head of a town, Offered ten of the finest towns To the thus-gone Nectar Conqueror And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྨ་བྱ་འབྲུ་མར་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་ཕུང་པོ་ལ། །མེ་ཏོག་འབར་ཤིས་བསྒོས་པའི་འབྲུ་མར་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mayūra, when an oil maker, Offered oil perfumed with vārṣikī flowers To the thus-gone Sun Mass And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་སྦྱིན་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་དབྱངས་དེ་ལ། །སིལ་སྙན་བརྒྱ་ཡིས་མཆོད་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharmadatta, when a prince, Offered the music of a hundred cymbals To the thus-gone Moon Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཕན་བཞེད་མགར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་མེ་ཏོག་ལ། །དྲ་གྲི་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Hitaiṣin, when a blacksmith, Offered knives To the thus-gone Divine Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་ལྡན་པ་དུང་འབུད་ཚེ། །དུང་སྒྲ་དག་ནི་བུད་པ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་རྣམ་དག་འོད་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānin, when a conch blower, Blew conches in worship Of the thus-gone Pure LightAnd in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་པ་ཚོང་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོན་ཀའི་ཉི་མ་ལ། །ནོར་བུ་བཻ་དཱུརྱ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Yaśas, when a merchant, Offered beryl To the thus-gone Autumn Sun And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འོད་ཟེར་དྲ་བ་ལོ་མའི་ཁུར་ཁྱེར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྣང་བ་བལྟ་ན་སྡུག་དེ་ལ། །ཧི་མིན་ཛ་ལའི་མེ་ཏོག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Raśmijāla, when carrying a load of leaves, Offered himinjala flowers To the thus-gone Beautiful Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཻ་དཱུརྱ་སྙིང་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟན་པའི་བློ་དེ་ལ། །ཨ་མྲ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vaiḍūryagarbha, when a forest guard, Offered mangoes To the thus-gone Steadfast Mind And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་ཤིང་སྲུངས་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྗོན་པའི་མེ་ཏོག་ལ། །ཏང་གའི་མེ་ཏོག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Puṣpa, when a forest guard, Offered tanga flowers To the thus-gone Flowering Tree And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷ་ཡི་རྒྱལ་པོ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འབར་བའི་དབྱངས་དེ་ལ། །སྐྱེད་མོས་ཚལ་ནི་བཅུ་སྙེད་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Devarāja, when a captain, Offered ten parks To the thus-gone Blazing Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་མགར་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་གོ་ཆ་ལ། །རིལ་བ་སྤྱི་ལུགས་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śaśin, when a blacksmith, Offered a water jar To the thus-gone Nectar Armor And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དྲན་འོད་ལྕགས་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་སྒྲ་དེ་ལ། །སྣར་བླུགས་པ་ཡི་སྤྱད་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Smṛtiprabha, when a blacksmith, Offered nasal therapy To the thus-gone Lion’s Roar And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་དགེ་འོད་དགེ་སློང་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགེ་བའི་ལྷ་དེ་ལ། །ནོར་བུའི་སྒྲོན་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Kuśalaprabha, when a monk, Offered jewel lamps To the thus-gone God of Virtue And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་མཆོག་མ་ཀུན་གྱི་འོད། །ཚོང་པའི་ཚེ་ན་བདེ་གཤེགས་དབྱངས་མཆོག་ལ། །ཤིང་ན་ག་ཡི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sarva­vara­guṇa­prabha, when a merchant, Scattered nāgapuṣpa flowers To the well-gone Supreme Melody And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཡི་དཔལ། །ཕྱག་དར་པ་ཚེ་བདེ་གཤེགས་དཔལ་དགྱེས་ལ། །གཙུག་ལག་ཁང་དང་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Ratnaśrī, when a sweeper, Offered a garland for a monastic temple To the well-gone Glorious Delight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེས་བུ་ཟླ་བ་བྲམ་ཟེའི་ཚེ། །གཅོང་རོང་དག་ཏུ་ཟམ་པ་བྱས་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་གྲགས་པ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Manuṣyacandra, when a brahmin, Built a bridge across a gorge Before the thus-gone Nectar Renown, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་གཅན་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་མེ་ཏོག་གི། །གདན་དག་ཡུད་ཙམ་གདིང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Rāhu, when a brahmin, Prepared temporary seats For the thus-gone Dharma Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བདུད་རྩིའི་འོད་ནི་གཞན་བྲན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བཀོད་པ་ཆེན་པོ་ལ། །ཉིན་མོ་བཞུགས་པའི་གནས་སུ་གདན་བཏིང་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Amṛtaprabha, when a servant of others, Prepared a seat where the thus-gone Great Array Was residing during the daytime, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་མཆོག་མ་ཚོང་དཔོན་གྱི། །བུ་ཚེ་བདེ་གཤེགས་འཇིག་རྟེན་བླ་མ་ལ། །དྷ་ནུ་སྐ་རིའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokajyeṣṭha, when the son of a merchant, Scattered dhanuṣkara flowers Before the well-gone Superior to the World And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྐར་འོད་དེད་དཔོན་ཚེ། །བདེ་གཤེགས་བློ་མཆོག་ལམ་དུ་ཞུགས་པ་ན། །མཚན་མོ་རྩྭ་སྒྲོན་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jyotiṣprabha, when a captain, Offered straw lamps during the night When the well-gone Supreme Mind was traveling And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཞི་བའི་སྟབས་ནི་རྒྱལ་པོའི་བུ། །ཁང་བཟངས་འཛེག་ཚེ་བདེ་གཤེགས་ལྷུན་འོད་ལ། །མེ་ཏོག་དག་གི་ཆུན་པོ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śāntagati, when a prince called Palace Ascender, Offered a bouquet of flowers To the well-gone Mountain of Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡེ་ཤེས་རྒྱ་མཚོ་མི་བཀྲེན་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་གཟི་ལ། །སྐྱུ་རུམ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jñānasāgara, when a destitute, Offered condiments To the thus-gone Splendid Nectar Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རི་དབང་ཕྲེང་རྒྱུད་བུ་མོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་གཟི་བརྗིད་ལ། །མེ་ཏོག་ཕྲེང་བ་ཁྲུ་གང་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Parvatendra, when the daughter of a garland maker, Offered a cubit-long flower garland To the thus-gone Splendor of Awakening And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་ཞི་སྨན་པའི་ཁྱེའུ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགོངས་པ་སྦྱངས་པ་ལ། །སྙུན་གྱི་གསོས་སྨན་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Praśānta, when a young physician, Offered medicine To the thus-gone Pure Intention And in doing so first gave rise to the mind of awakening.
